<h1> Pandas Notebook </h1>
    
__Author__ : `Hossam.__Asaad__()`

<h2>Table of Contents</h2>
<div class="alert alert-block alert-info" style="margin-top: 20px">
    <ol>
        <li><a href="#S1">Importing Data and Pandas version</a></li>
        <li><a href="#S2">Introduction Pandas Objects [Series and DataFrames]</a></li>
        <li><a href="#S3">Constructing DataFrame objects</a></li>
        <li><a href="#S4">Data Indexing and Selection</a></li>
        <li><a href="#S5">Handling Missing Data</a></li>
        <li><a href="#S6">Combining Datasets: Concat and Append</a></li>
        <li><a href="#S7">Combining Datasets: Merge and Join </a></li>
        <li><a href="#S8">Aggregation and Grouping </a></li>
        <li><a href="#S9">Pivot Tables</a></li>
    </ol>
<p>
</div>

<hr>

<h2 id='S1'> Importing Data and Pandas version </h2>

In [1]:
import numpy as np
import pandas as pd
pd.__version__

'0.25.1'

<h2 id='S2'>Introduction Pandas Objects</h2>

<h3> Tha pandas series object </h3>

A Pandas Series is a one-dimensional array of indexed data. It can be created from a list or array
you can think of a Pandas Series a bit like a specialization of a Python
dictionary. A dictionary is a structure that maps arbitrary keys to a set of arbitrary
values, and a Series is a structure that maps typed keys to a set of typed values.
`pd.Series(data, index=index)`

In [2]:
series = pd.Series([1, 4, 5, 7])
series

0    1
1    4
2    5
3    7
dtype: int64

In [3]:
series.values    # series values

array([1, 4, 5, 7], dtype=int64)

In [4]:
series.index     # series index

RangeIndex(start=0, stop=4, step=1)

In [5]:
series[2]        # series Accessing

5

In [6]:
series[2:4]

2    5
3    7
dtype: int64

In [7]:
series = pd.Series([1,7,6,8], index=['a','b','c','d'])     # using strings as index
series

a    1
b    7
c    6
d    8
dtype: int64

In [8]:
dictt = {'A':'Hossam', 'B':'Asaad','C':'Ragab'} # using dict to creat a series
series = pd.Series(dictt)
series

A    Hossam
B     Asaad
C     Ragab
dtype: object

In [9]:
series['B'] # indexing

'Asaad'

<h3> The Pandas DataFrame Object </h3>
    
- DataFrame is an analog of a two-dimensional array with both flexible row indices and flexible column names
- you can think of a DataFrame as a sequence of aligned Series objects. Here, by “aligned” we mean that they share the same index.

In [10]:
# Creatign Dataframe using series

area = pd.Series([15789, 18456, 8964], index = ['Egypt', 'US', 'Canada'])
populations = pd.Series([100, 150,75], index = ['Egypt', 'US', 'Canada'])
states = pd.DataFrame({'Area':area, 'Population':populations})
states

         Area  Population
Egypt   15789         100
US      18456         150
Canada   8964          75

In [11]:
states.index    # DataFrame index

Index(['Egypt', 'US', 'Canada'], dtype='object')

In [12]:
states.columns  # DataFrame columns labels

Index(['Area', 'Population'], dtype='object')

In [13]:
states['Area']  # DataFrame maps a column name to a Series of column data

Egypt     15789
US        18456
Canada     8964
Name: Area, dtype: int64

<h2 id="S3"> Constructing DataFrame objects </h2>
<h3> From a single Series object. </h3>

In [14]:
states = pd.DataFrame(area, columns=['Area'])
states

         Area
Egypt   15789
US      18456
Canada   8964

<h3> From a list of dicts. </h3>

In [15]:
data = [{'a': i, 'b': 2 * i} for i in range(3)]
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

In [16]:
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

<h3> From a dictionary of Series objects </h3>

In [17]:
states = pd.DataFrame({'Area':area, 'Population':populations})
states

         Area  Population
Egypt   15789         100
US      18456         150
Canada   8964          75

<h3> From a two-dimensional NumPy array. </h3>

In [18]:
pd.DataFrame(np.random.rand(3, 2),
columns=['foo', 'bar'],
index=['a', 'b', 'c'])

        foo       bar
a  0.798815  0.574674
b  0.389588  0.535474
c  0.776187  0.024586

<h2 id='S4'> Data Indexing and Selection </h2>

In [19]:
states = pd.DataFrame({'Area':area, 'Population':populations})
states

         Area  Population
Egypt   15789         100
US      18456         150
Canada   8964          75

In [20]:
states.Area is states['Area']

True

In [21]:
states['density'] = 100 * states['Population'] / states['Area']
states

         Area  Population   density
Egypt   15789         100  0.633352
US      18456         150  0.812744
Canada   8964          75  0.836680

In [22]:
states.T   # To transpose data frame
states

         Area  Population   density
Egypt   15789         100  0.633352
US      18456         150  0.812744
Canada   8964          75  0.836680

In [23]:
states.values

array([[1.57890000e+04, 1.00000000e+02, 6.33352334e-01],
       [1.84560000e+04, 1.50000000e+02, 8.12743823e-01],
       [8.96400000e+03, 7.50000000e+01, 8.36680054e-01]])

<h3> Indexers: loc, iloc </h3>

- `iloc[integer list of rows, integer list of columns]`
- `loc[list of labels, list of columns names]`
- The ix indexer allows a hybrid of these two approaches (deprecated)

In [24]:
states

         Area  Population   density
Egypt   15789         100  0.633352
US      18456         150  0.812744
Canada   8964          75  0.836680

In [25]:
states.iloc[:2,:3]

        Area  Population   density
Egypt  15789         100  0.633352
US     18456         150  0.812744

In [26]:
states.loc[:'US', :'desity']

        Area  Population   density
Egypt  15789         100  0.633352
US     18456         150  0.812744

In [27]:
states.loc[states.density > .8, :'Population']

         Area  Population
US      18456         150
Canada   8964          75

In [28]:
states[1:3]   # Additiona indexing method

         Area  Population   density
US      18456         150  0.812744
Canada   8964          75  0.836680

In [29]:
np.sin(states)

            Area  Population   density
Egypt  -0.600940   -0.506366  0.591850
US      0.755777   -0.714876  0.726176
Canada -0.860454   -0.387782  0.742423

In [30]:
np.exp(states)

        Area    Population   density
Egypt    inf  2.688117e+43  1.883916
US       inf  1.393710e+65  2.254084
Canada   inf  3.733242e+32  2.308690

<h2 id='S5'> Handling Missing Data </h2>

Pandas treats None and NaN as essentially interchangeable for indicating
missing or null values. To facilitate this convention, there are several useful
methods for detecting, removing, and replacing null values in Pandas data structures.
They are:
- `isnull()`  : Generate a Boolean mask indicating missing values
- `notnull()` : Opposite of `isnull()`
- `dropna()`  : Return a filtered version of the data
- `fillna()`  : Return a copy of the data with missing values filled or imputed

In [31]:
area = pd.Series([15789, 18456, np.nan], index = ['Egypt', 'US', 'Canada'])
populations = pd.Series([100, np.nan,75], index = ['Egypt', 'US', 'Canada'])
Income = pd.Series([1000, 2000, 3000], index = ['Egypt', 'US', 'Canada'])

states = pd.DataFrame({'Area':area, 'Population':populations, 'Income':Income})
states

           Area  Population  Income
Egypt   15789.0       100.0    1000
US      18456.0         NaN    2000
Canada      NaN        75.0    3000

In [32]:
states.isnull()

         Area  Population  Income
Egypt   False       False   False
US      False        True   False
Canada   True       False   False

In [33]:
states.notnull()

         Area  Population  Income
Egypt    True        True    True
US       True       False    True
Canada  False        True    True

In [34]:
states.dropna() # drop rows have NaN values

          Area  Population  Income
Egypt  15789.0       100.0    1000

In [35]:
states.dropna(axis = 1) # drop columns have NaN values

        Income
Egypt     1000
US        2000
Canada    3000

In [36]:
states[3] = np.nan # Adding a new column with NaN values
states

           Area  Population  Income   3
Egypt   15789.0       100.0    1000 NaN
US      18456.0         NaN    2000 NaN
Canada      NaN        75.0    3000 NaN

In [37]:
states.dropna(axis = 1, how = 'all')  # drop colums their all values is NaN // default (how = 'any')

           Area  Population  Income
Egypt   15789.0       100.0    1000
US      18456.0         NaN    2000
Canada      NaN        75.0    3000

In [38]:
# thresh parameter specify a minimum number of non-null values for the row/column to be kept
states.dropna(axis = 1, thresh = 1)

           Area  Population  Income
Egypt   15789.0       100.0    1000
US      18456.0         NaN    2000
Canada      NaN        75.0    3000

In [39]:
states.fillna(0)          # fill NaN values with 0

           Area  Population  Income    3
Egypt   15789.0       100.0    1000  0.0
US      18456.0         0.0    2000  0.0
Canada      0.0        75.0    3000  0.0

In [40]:
states.fillna(method='ffill') # replace with previous value

           Area  Population  Income   3
Egypt   15789.0       100.0    1000 NaN
US      18456.0       100.0    2000 NaN
Canada  18456.0        75.0    3000 NaN

In [41]:
states.fillna(method='bfill') # replace with next value

           Area  Population  Income   3
Egypt   15789.0       100.0    1000 NaN
US      18456.0        75.0    2000 NaN
Canada      NaN        75.0    3000 NaN

<h2 id='S6'> Hierarchical Indexing </h2>

<h3> A Multiply Indexed Series </h3>

<h4> The bad way: </h2>

In [42]:
index = [('California', 2000), ('California', 2010)
        ,('New York', 2000)  , ('New York', 2010)
        ,('Texas', 2000), ('Texas', 2010)]

populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]

df = pd.Series(populations, index=index)
df

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [43]:
df[('New York', 2000)]

18976457

<h4> The better way: Pandas MultiIndex </h4>

In [44]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [45]:
p = df.reindex(index)
p

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [46]:
states.stack()

Egypt   Area          15789.0
        Population      100.0
        Income         1000.0
US      Area          18456.0
        Income         2000.0
Canada  Population       75.0
        Income         3000.0
dtype: float64

In [47]:
states.unstack()

Area        Egypt     15789.0
            US        18456.0
            Canada        NaN
Population  Egypt       100.0
            US            NaN
            Canada       75.0
Income      Egypt      1000.0
            US         2000.0
            Canada     3000.0
3           Egypt         NaN
            US            NaN
            Canada        NaN
dtype: float64

<h3> Methods of MultiIndex Creation <h3?

In [48]:
df = pd.DataFrame( np.random.rand(4, 2),
                   index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                   columns=['data1', 'data2'])

df

        data1     data2
a 1  0.807891  0.324132
  2  0.293235  0.013113
b 1  0.445939  0.064022
  2  0.609747  0.831995

In [49]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [50]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [51]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [52]:
df.index.names = ['name', 'state'] #MultiIndex level names
df

               data1     data2
name state
a    1      0.807891  0.324132
     2      0.293235  0.013113
b    1      0.445939  0.064022
     2      0.609747  0.831995

In [53]:
#hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]], names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']], names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      31.0  38.3  36.0  37.8  13.0  37.8
     2      29.0  33.0  36.0  38.6  19.0  35.7
2014 1       8.0  36.7  41.0  36.9  48.0  36.4
     2      31.0  37.3  43.0  37.1  34.0  37.7

In [54]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      36.0  37.8
     2      36.0  38.6
2014 1      41.0  36.9
     2      43.0  37.1

In [55]:
health_data['Guido', 'Temp']

year  visit
2013  1        37.8
      2        38.6
2014  1        36.9
      2        37.1
Name: (Guido, Temp), dtype: float64

In [56]:
health_data.sort_index() # To sort index

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      31.0  38.3  36.0  37.8  13.0  37.8
     2      29.0  33.0  36.0  38.6  19.0  35.7
2014 1       8.0  36.7  41.0  36.9  48.0  36.4
     2      31.0  37.3  43.0  37.1  34.0  37.7

In [57]:
df.unstack(level = 0) # unstack first-level

          data1               data2
name          a         b         a         b
state
1      0.807891  0.445939  0.324132  0.064022
2      0.293235  0.609747  0.013113  0.831995

In [58]:
df.unstack(level = 1) # unstack second-level

          data1               data2
state         1         2         1         2
name
a      0.807891  0.293235  0.324132  0.013113
b      0.445939  0.609747  0.064022  0.831995

<h2 id = 'S6' > Data Aggregations on Multi-Indices </h2>

In [59]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      31.0  38.3  36.0  37.8  13.0  37.8
     2      29.0  33.0  36.0  38.6  19.0  35.7
2014 1       8.0  36.7  41.0  36.9  48.0  36.4
     2      31.0  37.3  43.0  37.1  34.0  37.7

In [60]:
health_data.mean()      # get the mean of all data

subject  type
Bob      HR      24.750
         Temp    36.325
Guido    HR      39.000
         Temp    37.600
Sue      HR      28.500
         Temp    36.900
dtype: float64

In [61]:
health_data.mean(level = 0)  # naming the index level we’d like to explore

subject   Bob        Guido         Sue
type       HR   Temp    HR  Temp    HR   Temp
year
2013     30.0  35.65  36.0  38.2  16.0  36.75
2014     19.5  37.00  42.0  37.0  41.0  37.05

In [62]:
health_data.mean(level = 0, axis=1) # take the mean among levels on the columns

subject       Bob  Guido    Sue
year visit
2013 1      34.65  36.90  25.40
     2      31.00  37.30  27.35
2014 1      22.35  38.95  42.20
     2      34.15  40.05  35.85

<h2 id='S6'> Combining Datasets: Concat and Append </h2>

- Concatenation of Series and DataFrame objects is very similar to concatenation of
NumPy arrays, which can be done via the `np.concatenate` function
- Pandas has a function, `pd.concat()`, which has a similar syntax to `np.concatenate`
but contains a number of options

In [63]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [64]:
df1 = states.iloc[0:1,:]
df2 = states.iloc[1:3,:]
pd.concat([df1, df2])

           Area  Population  Income   3
Egypt   15789.0       100.0    1000 NaN
US      18456.0         NaN    2000 NaN
Canada      NaN        75.0    3000 NaN

In [65]:
# verify_integrity : check if there are duplicate indices
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[1, 2, 3])
try:
    pd.concat([ser1, ser2], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([1, 2, 3], dtype='int64')

In [66]:
# Ignoring the index.
pd.concat([ser1, ser2], ignore_index = True)

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

In [67]:
# Adding MultiIndex keys.
pd.concat([ser1, ser2], keys = ['ser1', 'ser2'])

ser1  1    A
      2    B
      3    C
ser2  1    D
      2    E
      3    F
dtype: object

<h3> Concatenation with joins </h3>

In [68]:
# split data frame 
df1 = states.iloc[0:1,:]
df2 = states.iloc[1:3,:]

# create a new column on df1
df1['test'] = 5
df1

C:\Users\hossa\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

          Area  Population  Income   3  test
Egypt  15789.0       100.0    1000 NaN     5

In [69]:
df2

           Area  Population  Income   3
US      18456.0         NaN    2000 NaN
Canada      NaN        75.0    3000 NaN

In [70]:
pd.concat([df1, df2], join = 'outer') # by default

C:\Users\hossa\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

           Area  Income  Population   3  test
Egypt   15789.0    1000       100.0 NaN   5.0
US      18456.0    2000         NaN NaN   NaN
Canada      NaN    3000        75.0 NaN   NaN

In [71]:
pd.concat([df1, df2], join = 'inner')

           Area  Population  Income   3
Egypt   15789.0       100.0    1000 NaN
US      18456.0         NaN    2000 NaN
Canada      NaN        75.0    3000 NaN

<h3> The append() method </h3>

In [72]:
df1.append(df2)

C:\Users\hossa\Anaconda3\lib\site-packages\pandas\core\frame.py:7123: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

           Area  Income  Population   3  test
Egypt   15789.0    1000       100.0 NaN   5.0
US      18456.0    2000         NaN NaN   NaN
Canada      NaN    3000        75.0 NaN   NaN

<h2 id='S7'> Combining Datasets: Merge and Join </h2>

- The `pd.merge()` function implements a number of types of joins:
    + the one-to-one
    + many-to-one
    + many-to-many joins.
- he type of join performed depends on the form of the input data

In [73]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],'hire_date': [2004, 2008, 2012, 2014]})
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [74]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

<h3> One-to-one join </h3>

In [75]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

<h3> Many-to-one join </h3>

In [76]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [77]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

<h3> Many-to-many join </h3>

In [78]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 'Engineering', 'HR', 'HR'],'skills': ['math', 'spreadsheets', 'coding', 'linux',
'spreadsheets', 'organization']})
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [79]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

<h3> Specification of the Merge Key </h3>

#### The on keyword

In [80]:
pd.merge(df1, df2, on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [81]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'salary': [70000, 80000, 120000, 90000]})
pd.merge(df1, df3, left_on="employee", right_on="name")

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [82]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1) # drop 'name' coulumn

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [83]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [84]:
df2a

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [85]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

<h3>JOIN</h3>

For convenience, DataFrames implement the join() method, which performs a
merge that defaults to joining on indices:

In [86]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

<h3> Overlapping Column Names: The suffixes Keyword </h3>

In [87]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'rank': [1, 2, 3, 4]})
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [88]:
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'rank': [3, 1, 4, 2]})
df9

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [89]:
pd.merge(df8, df9, on = 'name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [90]:
pd.merge(df8, df9, on="name", suffixes=["_L", "_R"]) # Add suffixes to columns name

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

<h2 ip='S8'> Aggregation and Grouping </h2>

In [91]:
# importing some data to use it
import seaborn as sns
planets = sns.load_dataset('planets')

series = pd.Series([1, 4, 5, 7])

planets.shape

(1035, 6)

In [92]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [93]:
series.sum()

17

In [94]:
series.mean()

4.25

In [95]:
# describe() that computes several common aggregates for each column and returns the result
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [96]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

<h3> GroupBy: Split, Apply, Combine </h3>

- The split step involves breaking up and grouping a DataFrame depending on the
value of the specified key.
- The apply step involves computing some function, usually an aggregate, transformation,
or filtering, within the individual groups.
- The combine step merges the results of these operations into an output array

In [97]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [98]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [99]:
planets.groupby('method').orbital_period.median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

### Aggregation

 - `aggregate()` method allows for even more flexibility
 - take a string, a function, or a list thereof, and compute all the aggregates at once

In [100]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data1': range(6),
'data2': rng.randint(0, 10, 6)},
columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [101]:
df.groupby('key').aggregate(['min', np.median, 'max']) # calc min, median and max for each key

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [102]:
df.groupby('key').aggregate({'data1': 'min', 'data2': 'max'}) # calc min of data1 and max of data2

     data1  data2
key
A        0      5
B        1      7
C        2      9

### Filtering.

A filtering operation allows you to drop data based on the group properties.
For example, we might want to keep all groups in which the standard deviation is
larger than some critical value:

In [103]:
df.groupby('key').std()

       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

In [104]:
def filter_func(x):
    return x['data2'].std() > 4

df.groupby('key').filter(filter_func)

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

### Transformation.
While aggregation must return a reduced version of the data, transformation
can return some transformed version of the full data to recombine

In [105]:
# center the data by subtracting the group-wise mean
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

### The apply() method.
__`apply()`__ lets you apply an arbitrary function to the
group results. The function should take a DataFrame, and return either a Pandas
object (e.g., DataFrame, Series) or a scalar

In [106]:
def norm_by_data2(x):
# x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x

df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

<h2 id='S9'> Pivot Tables </h2>

In [107]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [108]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [109]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [110]:
titanic.pivot_table(values = 'survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [111]:
titanic.pivot_table(index='sex', columns='class',
aggfunc={'survived':sum, 'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [112]:
titanic.pivot_table('survived', index='sex', columns='class', margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838